spec/fixtures/stripe_webhooks/coupon-code-applied.json

{
  "id": "evt_123",
  "object": "event",
  "api_version": "2017-01-27",
  "created": 1531807868,
  "data": {
    "object": {
      "id": "sub_123",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1537433042,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1511882257,
      "current_period_end": 1537433042,
      "current_period_start": 1511882257,
      "customer": "cus_123",
      "days_until_due": null,
      "discount": {
        "object": "discount",
        "coupon": {
          "id": "COUPON-123",
          "object": "coupon",
          "amount_off": null,
          "created": 1531807803,
          "currency": null,
          "duration": "forever",
          "duration_in_months": null,
          "livemode": true,
          "max_redemptions": null,
          "metadata": {},
          "name": "COUPON-123",
          "percent_off": 100,
          "redeem_by": null,
          "times_redeemed": 1,
          "valid": true
        },
        "customer": "cus_123",
        "end": null,
        "start": 1531807868,
        "subscription": "sub_123"
      },
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_123",
            "object": "subscription_item",
            "created": 1511882258,
            "metadata": {},
            "plan": {
              "id": "pro",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 833,
              "billing_scheme": "per_unit",
              "created": 1511536024,
              "currency": "gbp",
              "interval": "month",
              "interval_count": 1,
              "livemode": true,
              "metadata": {},
              "name": "Pro",
              "nickname": null,
              "product": "prod_123",
              "statement_descriptor": null,
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_123"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_123"
      },
      "livemode": true,
      "metadata": {},
      "plan": {
        "id": "pro",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 833,
        "billing_scheme": "per_unit",
        "created": 1511536024,
        "currency": "gbp",
        "interval": "month",
        "interval_count": 1,
        "livemode": true,
        "metadata": {},
        "name": "Pro",
        "nickname": null,
        "product": "prod_123",
        "statement_descriptor": null,
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "start": 1511882257,
      "status": "trialing",
      "tax_percent": 20.0,
      "trial_end": 1537433042,
      "trial_start": 1511882257
    },
    "previous_attributes": {
      "discount": null
    }
  },
  "livemode": true,
  "pending_webhooks": 2,
  "request": "req_123",
  "type": "customer.subscription.updated",
  "controller": "alaveteli_pro/stripe_webhooks",
  "action": "receive",
  "stripe_webhook": {
    "id": "evt_123",
    "object": "event",
    "api_version": "2017-01-27",
    "created": 1531807868,
    "data": {
      "object": {
        "id": "sub_123",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "billing_cycle_anchor": 1537433042,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1511882257,
        "current_period_end": 1537433042,
        "current_period_start": 1511882257,
        "customer": "cus_123",
        "days_until_due": null,
        "discount": {
          "object": "discount",
          "coupon": {
            "id": "COUPON-123",
            "object": "coupon",
            "amount_off": null,
            "created": 1531807803,
            "currency": null,
            "duration": "forever",
            "duration_in_months": null,
            "livemode": true,
            "max_redemptions": null,
            "metadata": {},
            "name": "COUPON-123",
            "percent_off": 100,
            "redeem_by": null,
            "times_redeemed": 1,
            "valid": true
          },
          "customer": "cus_123",
          "end": null,
          "start": 1531807868,
          "subscription": "sub_123"
        },
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_123",
              "object": "subscription_item",
              "created": 1511882258,
              "metadata": {},
              "plan": {
                "id": "pro",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 833,
                "billing_scheme": "per_unit",
                "created": 1511536024,
                "currency": "gbp",
                "interval": "month",
                "interval_count": 1,
                "livemode": true,
                "metadata": {},
                "name": "Pro",
                "nickname": null,
                "product": "prod_123",
                "statement_descriptor": null,
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "quantity": 1,
              "subscription": "sub_123"
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_123"
        },
        "livemode": true,
        "metadata": {},
        "plan": {
          "id": "pro",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 833,
          "billing_scheme": "per_unit",
          "created": 1511536024,
          "currency": "gbp",
          "interval": "month",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "name": "Pro",
          "nickname": null,
          "product": "prod_123",
          "statement_descriptor": null,
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "start": 1511882257,
        "status": "trialing",
        "tax_percent": 20.0,
        "trial_end": 1537433042,
        "trial_start": 1511882257
      },
      "previous_attributes": {
        "discount": null
      }
    },
    "livemode": true,
    "pending_webhooks": 2,
    "request": "req_123",
    "type": "customer.subscription.updated"
  }
}
