spec/fixtures/stripe_webhooks/plan-changed.json

{
  "id": "evt_123",
  "object": "event",
  "api_version": "2017-01-27",
  "created": 1534859120,
  "data": {
    "object": {
      "id": "sub_123",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1535446800,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1511884457,
      "current_period_end": 1535446800,
      "current_period_start": 1534859120,
      "customer": "cus_123",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_123",
            "object": "subscription_item",
            "created": 1534859120,
            "metadata": {},
            "plan": {
              "id": "pro-annual-billing",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 8333,
              "billing_scheme": "per_unit",
              "created": 1517835271,
              "currency": "gbp",
              "interval": "year",
              "interval_count": 1,
              "livemode": true,
              "metadata": {},
              "name": "Pro Annual Billing",
              "nickname": null,
              "product": "prod_123",
              "statement_descriptor": null,
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_123"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_123"
      },
      "livemode": true,
      "metadata": {},
      "plan": {
        "id": "pro-annual-billing",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 8333,
        "billing_scheme": "per_unit",
        "created": 1517835271,
        "currency": "gbp",
        "interval": "year",
        "interval_count": 1,
        "livemode": true,
        "metadata": {},
        "name": "Pro Annual Billing",
        "nickname": null,
        "product": "prod_123",
        "statement_descriptor": null,
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "start": 1534859120,
      "status": "trialing",
      "tax_percent": 20.0,
      "trial_end": 1535446800,
      "trial_start": 1511884457
    },
    "previous_attributes": {
      "current_period_start": 1511884457,
      "items": {
        "data": [
          {
            "id": "si_123",
            "created": 1511884457,
            "plan": {
              "id": "pro",
              "amount": 833,
              "created": 1511536024,
              "interval": "month",
              "name": "Pro",
              "product": "prod_123"
            }
          }
        ]
      },
      "plan": {
        "id": "pro",
        "amount": 833,
        "created": 1511536024,
        "interval": "month",
        "name": "Pro",
        "product": "prod_123"
      },
      "start": 1534756846
    }
  },
  "livemode": true,
  "pending_webhooks": 2,
  "request": "req_123",
  "type": "customer.subscription.updated",
  "controller": "alaveteli_pro/stripe_webhooks",
  "action": "receive",
  "stripe_webhook": {
    "id": "evt_123",
    "object": "event",
    "api_version": "2017-01-27",
    "created": 1534859120,
    "data": {
      "object": {
        "id": "sub_123",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "billing_cycle_anchor": 1535446800,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1511884457,
        "current_period_end": 1535446800,
        "current_period_start": 1534859120,
        "customer": "cus_123",
        "days_until_due": null,
        "discount": null,
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_123",
              "object": "subscription_item",
              "created": 1534859120,
              "metadata": {},
              "plan": {
                "id": "pro-annual-billing",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 8333,
                "billing_scheme": "per_unit",
                "created": 1517835271,
                "currency": "gbp",
                "interval": "year",
                "interval_count": 1,
                "livemode": true,
                "metadata": {},
                "name": "Pro Annual Billing",
                "nickname": null,
                "product": "prod_123",
                "statement_descriptor": null,
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "quantity": 1,
              "subscription": "sub_123"
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_123"
        },
        "livemode": true,
        "metadata": {},
        "plan": {
          "id": "pro-annual-billing",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 8333,
          "billing_scheme": "per_unit",
          "created": 1517835271,
          "currency": "gbp",
          "interval": "year",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "name": "Pro Annual Billing",
          "nickname": null,
          "product": "prod_123",
          "statement_descriptor": null,
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "start": 1534859120,
        "status": "trialing",
        "tax_percent": 20.0,
        "trial_end": 1535446800,
        "trial_start": 1511884457
      },
      "previous_attributes": {
        "current_period_start": 1511884457,
        "items": {
          "data": [
            {
              "id": "si_123",
              "created": 1511884457,
              "plan": {
                "id": "pro",
                "amount": 833,
                "created": 1511536024,
                "interval": "month",
                "name": "Pro",
                "product": "prod_123"
              }
            }
          ]
        },
        "plan": {
          "id": "pro",
          "amount": 833,
          "created": 1511536024,
          "interval": "month",
          "name": "Pro",
          "product": "prod_123"
        },
        "start": 1534756846
      }
    },
    "livemode": true,
    "pending_webhooks": 2,
    "request": "req_123",
    "type": "customer.subscription.updated"
  }
}
