spec/fixtures/stripe_webhooks/subscription-reactivated.json

{
  "id": "evt_123",
  "object": "event",
  "api_version": "2017-01-27",
  "created": 1520267708,
  "data": {
    "object": {
      "id": "sub_123",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1513600201,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1513600201,
      "current_period_end": 1521376201,
      "current_period_start": 1518957001,
      "customer": "cus_123",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_123",
            "object": "subscription_item",
            "created": 1513600202,
            "metadata": {},
            "plan": {
              "id": "pro",
              "object": "plan",
              "amount": 833,
              "created": 1511536024,
              "currency": "gbp",
              "interval": "month",
              "interval_count": 1,
              "livemode": true,
              "metadata": {},
              "nickname": null,
              "product": "prod_123",
              "trial_period_days": null,
              "statement_descriptor": null,
              "name": "Pro"
            },
            "quantity": 1,
            "subscription": "sub_123"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_123"
      },
      "livemode": true,
      "metadata": {},
      "plan": {
        "id": "pro",
        "object": "plan",
        "amount": 833,
        "created": 1511536024,
        "currency": "gbp",
        "interval": "month",
        "interval_count": 1,
        "livemode": true,
        "metadata": {},
        "nickname": null,
        "product": "prod_123",
        "trial_period_days": null,
        "statement_descriptor": null,
        "name": "Pro"
      },
      "quantity": 1,
      "start": 1513600201,
      "status": "active",
      "tax_percent": 20.0,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "cancel_at_period_end": true,
      "canceled_at": 1519317815
    }
  },
  "livemode": true,
  "pending_webhooks": 2,
  "request": "req_123",
  "type": "customer.subscription.updated",
  "controller": "alaveteli_pro/stripe_webhooks",
  "action": "receive",
  "stripe_webhook": {
    "id": "evt_123",
    "object": "event",
    "api_version": "2017-01-27",
    "created": 1520267708,
    "data": {
      "object": {
        "id": "sub_123",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "billing_cycle_anchor": 1513600201,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1513600201,
        "current_period_end": 1521376201,
        "current_period_start": 1518957001,
        "customer": "cus_123",
        "days_until_due": null,
        "discount": null,
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_123",
              "object": "subscription_item",
              "created": 1513600202,
              "metadata": {},
              "plan": {
                "id": "pro",
                "object": "plan",
                "amount": 833,
                "created": 1511536024,
                "currency": "gbp",
                "interval": "month",
                "interval_count": 1,
                "livemode": true,
                "metadata": {},
                "nickname": null,
                "product": "prod_123",
                "trial_period_days": null,
                "statement_descriptor": null,
                "name": "Pro"
              },
              "quantity": 1,
              "subscription": "sub_123"
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_123"
        },
        "livemode": true,
        "metadata": {},
        "plan": {
          "id": "pro",
          "object": "plan",
          "amount": 833,
          "created": 1511536024,
          "currency": "gbp",
          "interval": "month",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "nickname": null,
          "product": "prod_123",
          "trial_period_days": null,
          "statement_descriptor": null,
          "name": "Pro"
        },
        "quantity": 1,
        "start": 1513600201,
        "status": "active",
        "tax_percent": 20.0,
        "trial_end": null,
        "trial_start": null
      },
      "previous_attributes": {
        "cancel_at_period_end": true,
        "canceled_at": 1519317815
      }
    },
    "livemode": true,
    "pending_webhooks": 2,
    "request": "req_123",
    "type": "customer.subscription.updated"
  }
}
