spec/fixtures/stripe_webhooks/subscription-renewal-repeated-failure.json

{
  "id": "evt_123",
  "object": "event",
  "api_version": "2017-01-27",
  "created": 1529075593,
  "data": {
    "object": {
      "id": "sub_123",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1516029146,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1516029146,
      "current_period_end": 1531667546,
      "current_period_start": 1529075546,
      "customer": "cus_123",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_123",
            "object": "subscription_item",
            "created": 1516029147,
            "metadata": {},
            "plan": {
              "id": "pro",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 833,
              "billing_scheme": "per_unit",
              "created": 1511536024,
              "currency": "gbp",
              "interval": "month",
              "interval_count": 1,
              "livemode": true,
              "metadata": {},
              "name": "Pro",
              "nickname": null,
              "product": "prod_123",
              "statement_descriptor": null,
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_123"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_123"
      },
      "livemode": true,
      "metadata": {},
      "plan": {
        "id": "pro",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 833,
        "billing_scheme": "per_unit",
        "created": 1511536024,
        "currency": "gbp",
        "interval": "month",
        "interval_count": 1,
        "livemode": true,
        "metadata": {},
        "name": "Pro",
        "nickname": null,
        "product": "prod_123",
        "statement_descriptor": null,
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "start": 1516029146,
      "status": "past_due",
      "tax_percent": 20.0,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "current_period_end": 1529075546,
      "current_period_start": 1526397146
    }
  },
  "livemode": true,
  "pending_webhooks": 2,
  "request": null,
  "type": "customer.subscription.updated",
  "controller": "alaveteli_pro/stripe_webhooks",
  "action": "receive",
  "stripe_webhook": {
    "id": "evt_123",
    "object": "event",
    "api_version": "2017-01-27",
    "created": 1529075593,
    "data": {
      "object": {
        "id": "sub_123",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "billing_cycle_anchor": 1516029146,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1516029146,
        "current_period_end": 1531667546,
        "current_period_start": 1529075546,
        "customer": "cus_123",
        "days_until_due": null,
        "discount": null,
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_123",
              "object": "subscription_item",
              "created": 1516029147,
              "metadata": {},
              "plan": {
                "id": "pro",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 833,
                "billing_scheme": "per_unit",
                "created": 1511536024,
                "currency": "gbp",
                "interval": "month",
                "interval_count": 1,
                "livemode": true,
                "metadata": {},
                "name": "Pro",
                "nickname": null,
                "product": "prod_123",
                "statement_descriptor": null,
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "quantity": 1,
              "subscription": "sub_123"
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_123"
        },
        "livemode": true,
        "metadata": {},
        "plan": {
          "id": "pro",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 833,
          "billing_scheme": "per_unit",
          "created": 1511536024,
          "currency": "gbp",
          "interval": "month",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "name": "Pro",
          "nickname": null,
          "product": "prod_123",
          "statement_descriptor": null,
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "start": 1516029146,
        "status": "past_due",
        "tax_percent": 20.0,
        "trial_end": null,
        "trial_start": null
      },
      "previous_attributes": {
        "current_period_end": 1529075546,
        "current_period_start": 1526397146
      }
    },
    "livemode": true,
    "pending_webhooks": 2,
    "request": null,
    "type": "customer.subscription.updated"
  }
}
