spec/fixtures/stripe_webhooks/trial-extended.json

{
  "id": "evt_123",
  "object": "event",
  "api_version": "2017-01-27",
  "created": 1517317961,
  "data": {
    "object": {
      "id": "sub_123",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1511884095,
      "current_period_end": 1519862400,
      "current_period_start": 1511884095,
      "customer": "cus_123",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_123",
            "object": "subscription_item",
            "created": 1511884095,
            "metadata": {},
            "plan": {
              "id": "pro",
              "object": "plan",
              "amount": 833,
              "created": 1511536024,
              "currency": "gbp",
              "interval": "month",
              "interval_count": 1,
              "livemode": true,
              "metadata": {},
              "name": "Pro",
              "statement_descriptor": null,
              "trial_period_days": null
            },
            "quantity": 1,
            "subscription": "sub_123"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_123"
      },
      "livemode": true,
      "metadata": {},
      "plan": {
        "id": "pro",
        "object": "plan",
        "amount": 833,
        "created": 1511536024,
        "currency": "gbp",
        "interval": "month",
        "interval_count": 1,
        "livemode": true,
        "metadata": {},
        "name": "Pro",
        "statement_descriptor": null,
        "trial_period_days": null
      },
      "quantity": 1,
      "start": 1517317961,
      "status": "trialing",
      "tax_percent": 20.0,
      "trial_end": 1519862400,
      "trial_start": 1511884095
    },
    "previous_attributes": {
      "current_period_end": 1519304305,
      "start": 1511884095,
      "trial_end": 1519304305
    }
  },
  "livemode": true,
  "pending_webhooks": 2,
  "request": "req_123",
  "type": "customer.subscription.updated",
  "controller": "alaveteli_pro/stripe_webhooks",
  "action": "receive",
  "stripe_webhook": {
    "id": "evt_123",
    "object": "event",
    "api_version": "2017-01-27",
    "created": 1517317961,
    "data": {
      "object": {
        "id": "sub_123",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1511884095,
        "current_period_end": 1519862400,
        "current_period_start": 1511884095,
        "customer": "cus_123",
        "days_until_due": null,
        "discount": null,
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_123",
              "object": "subscription_item",
              "created": 1511884095,
              "metadata": {},
              "plan": {
                "id": "pro",
                "object": "plan",
                "amount": 833,
                "created": 1511536024,
                "currency": "gbp",
                "interval": "month",
                "interval_count": 1,
                "livemode": true,
                "metadata": {},
                "name": "Pro",
                "statement_descriptor": null,
                "trial_period_days": null
              },
              "quantity": 1,
              "subscription": "sub_123"
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_123"
        },
        "livemode": true,
        "metadata": {},
        "plan": {
          "id": "pro",
          "object": "plan",
          "amount": 833,
          "created": 1511536024,
          "currency": "gbp",
          "interval": "month",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "name": "Pro",
          "statement_descriptor": null,
          "trial_period_days": null
        },
        "quantity": 1,
        "start": 1517317961,
        "status": "trialing",
        "tax_percent": 20.0,
        "trial_end": 1519862400,
        "trial_start": 1511884095
      },
      "previous_attributes": {
        "current_period_end": 1519304305,
        "start": 1511884095,
        "trial_end": 1519304305
      }
    },
    "livemode": true,
    "pending_webhooks": 2,
    "request": "req_123",
    "type": "customer.subscription.updated"
  }
}
